Kolo-Naukowe-Informatykow-UR/AntyBrainFogur/firmware/matter-display/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ── CPU ──────────────────────────────────────────────────────────────────
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ── PSRAM (S3R8 — Octal 8 MB) ────────────────────────────────────────────
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0

# ── Flash size ───────────────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ── Custom partition table (adds Matter NVS partitions after app) ────────
# chip_factory / chip_config / chip_counters are required by esp-matter.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ── Stack / heap ─────────────────────────────────────────────────────────
# Bumped to 16 KB — Matter init runs partly inside app_main.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# ── Logging ──────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ── FreeRTOS ─────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000

# ── LVGL — custom malloc so memory comes from PSRAM heap ─────────────────
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y
# QR code widget — needed by the Matter Setup popup
CONFIG_LV_USE_QRCODE=y

# ── BLE / NimBLE — required for Matter BLE commissioning on ESP32-S3 ─────
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Allow up to 3 simultaneous BLE connections (Matter + CHIP shell)
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
# Release BLE memory after commissioning to free ~30 KB RAM
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y

# ── mbedTLS extras required by CHIP crypto ───────────────────────────────
# HKDF (HMAC-based Key Derivation Function) — used by CHIPCryptoPALmbedTLS
# for key material expansion; without this mbedtls_hkdf is undefined at link.
CONFIG_MBEDTLS_HKDF_C=y

# ── Matter / CHIP stack ──────────────────────────────────────────────────
# Disable the interactive CHIP shell (saves ~50 KB flash, not needed here)
CONFIG_ENABLE_CHIP_SHELL=n
# OpenThread is not used — WiFi + BLE only
CONFIG_OPENTHREAD_ENABLED=n
# Disable NVS encryption for development builds
CONFIG_NVS_ENCRYPTION=n
